app/Http/Controllers/AdminUserController.php

select * from `users` limit 5 offset 0
select count(*) as aggregate from `users`
---
    public function index()
    {
        $usersList = $this->user->paginate(5);

select * from `roles`
---
    public function create()
    {
       $roleList = Role::all();

insert into `users` (`name`, `email`, `password`, `role_id`, `user_id`, `street`, `ward`, `district`, `updated_at`, `created_at`) values ('Tran Ky Hung', 'trankyhung225123213213@gmail.com', '1232131232132132133213', '1', 1, '12321321321312', '123123213213', '1231223213', '2022-08-17 15:50:23', '2022-08-17 15:50:23')
---
    public function store(UserRequest $request)
    {
        if(Auth::check())
            $user_id = auth()->user()->id;

            $data=[
                'name'=>$request->name,
                'email'=>$request->email,
                'password'=>Hash::make($request->password),
                'role_id'=>$request->role,
                'user_id'=>$user_id ,
                'street'=>$request->street,
                'ward'=> $request->ward,
                'district'=>$request->district
            ];
            $checkSuccess=User::create($data);

select * from `roles`
select * from `users` where `users`.`id` = '5' limit 1
---
    public function edit(Request $request,$id)
    {
        $roleList = Role::all();
        $userInfo = $this->user::find($id);

select * from `users` where `id` in ('2')
---
       $checkSuccess = $this->user::find($id)->update($data);
       if($checkSuccess)
       {
        return redirect()->route('admin.users.index')->with('msg','Update successfully')->with('type','success');

delete from `users` where `id` = 2
---
    public function delete($id)
    {
        $checkSuccess =  $this->user::destroy($id);