app/Http/Controllers/MenuController.php

    public function index()
    {
        $menus = $this->menu->paginate(10);
---
select count(*) as aggregate from `menus` where `menus`.`deleted_at` is null